app/views/restaurants/show.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."restaurant_id" = ?  [["restaurant_id", 3]]
---
<h2>Ratings</h2>
<% @restaurant.ratings.each do |rating| %>