app/controllers/ratings_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "ratings" ("rater", "comment", "score", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rater", "Rory"], ["comment", "It suckeded"], ["score", 1], ["restaurant_id", 1], ["created_at", "2017-10-19 14:04:33.708599"], ["updated_at", "2017-10-19 14:04:33.708599"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    @rating = @restaurant.ratings.create(rating_params)