app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."restaurant_id" = ?  [["restaurant_id", 1]]

  def show
    ratings_array = grab_ratings_for(params[:id].to_i)
    p ratings_array
    @average = ratings_array.reduce(:+).to_f / ratings_array.size
    p @average
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @restaurant = Restaurant.new(restaurant_params)
    # binding.pry
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "rating", "address", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Blibble"], ["rating", 0], ["address", "Bloobble"], ["description", "fewfge"], ["created_at", "2017-10-19 11:38:26.794489"], ["updated_at", "2017-10-19 11:38:26.794489"]]

  def update
    @restaurant = Restaurant.find(params[:id])

    if @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "restaurants" SET "name" = ?, "address" = ?, "description" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "Adele's Bistro"], ["address", "Chelsea"], ["description", "French"], ["updated_at", "2017-10-17 15:21:41.433568"], ["id", 1]]